{
  "entrepreneur": "Entrepreneur",
  "skater": "Skater",
  "developer": "Developer",
  "skatevideos": "Skate videos",
  "frontpage": "Front Page",
  "navigation": "Navigation",
  "jackofalltrades": "Jack of all trades",
  "movies_by_date": "Movies by release date",
  "ig_highlights": "Highlighted Instagram videos",
  "other": "Other",
  "jerryselin": "Jerry Selin",
  "Jerry Selin": "Jerry Selin",
  "skatepark_building": "Building skateparks",
  "skatepark_building_desc": "Building skateable things have always been part of my skateboarding. I enjoy building as weird obstacles as my bag of tricks. I have been building and planning the Bommari indoor skatepark since 2016. Before that I have been building some small things on my parents terrace. A summer 2020 we built a mini ramp at the very same spot. I have also been involved with building mini ramp at Wake Valley.",
  "parent_mini": "Miniramp at my parents' terrace",
  "bommari": "Bommari private indoor park",
  "wake_valley": "Wake Valley",
  "welcome": "Well, look at you! You found my page!",
  "welcome_long": "Welcome aboard, I am Jerry Selin. I tend to stack projects, duties and responsibilities on my plate. Why do I do that? Doing and learning something new fascinates me, that's why. A lot of projects has been completed but some projects are lifetime deals. I have added some references from both types on this page. Enjoy, get inspired & start doing your thing!",
  "ar": "Instagram AR-filters",
  "giphy": "Instagram animated stickers",
  "3d_modelling": "3D modelling",
  "3d_printing": "3D printing",
  "photo_editing": "Photo making and editing",
  "video_editing": "Video editing",
  "electronics": "Electronics",
  "events": "Organizing events",
  "3d_modelling_desc": "I have done several skate park models with SketchUp. For 3d printing models and general engineering I use OnShape, SolidWorks and NX CAD.",
  "events_desc": "Most of the events are organized with TTHP (ski club in our university). Besides this, I often find myself organizing the small events like indoor skate park rent for a night. Following posters are also created by me.",
  "student": "University student",
  "student_desc": "I have bachelor of science degree and I am studying for masters degree in information technology at Tampere University.",
  "electronics_desc": "el",
  "giphy_desc": "Gifs I have added to Giphy. These are available on apps that uses Giphy, for example, Instagram, Snapchat and Telegram.",
  "how_old": "How old are you?",
  "electronics_desc_1": "Besides burning my hands with soldering iron, I have also burned some code into Arduino. Here are couple of my electronics projects:" ,
  "electronics_desc_2": "I have soldered a ",
  "electronics_desc_3": "bluetooth speaker",
  "electronics_desc_4": ". Case of the speaker is originally made out of cardboard and duct tape. After a while, I decided to use carbon fiber car tape to make it look more elegant.",
  "electronics_desc_5": "Arduino smart sauna",
  "electronics_desc_6": ", which is build with WiFi Arduino, servo motor and a piece of code. It is a web server that can turn my sauna on and off.",
  "ar_desc": "One filter which generates random skate spot and one which generates random skate trick. Made with Spark AR Studio.",
  "bday1": "Thank you for asking. I am ",
  "bday2": " years old and my birthday is just around the corner, only ",
  "bday3": " days remaining. Remember to get me a nice present.",
  "how_you_learned": "How did you learn all this?",
  "how_you_learned_answer": "Internet dude, from internet! It takes just couple Google searches and Youtube videos to learn something new.",
  "scroll_top": "Scroll to top",
  "open_skatevideos": "Open skate videos page",
  "open_developer": "Open developer page",
  "open_entrepreneur": "Open entrepreneur page",
  "open_jackofalltrades": "Open other projects page"
}