{
  "entrepreneur": "Entrepreneur",
  "skater": "Skater",
  "developer": "Developer",
  "skatevideos": "Skate videos",
  "frontpage": "Front Page",
  "navigation": "Navigation",
  "jackofalltrades": "Jack of all trades",
  "movies_by_date": "Movies by release date",
  "ig_highlights": "Highlighted Instagram videos",
  "other": "Other",
  "jerryselin": "Jerry Selin",
  "Jerry Selin": "Jerry Selin",
  "skatepark_building": "Building skateparks",
  "skatepark_building_desc": "Building skateable things have always been part of my skateboarding. I enjoy building as weird obstacles as my bag of tricks. I have been building and planning the Bommari indoor skatepark since 2016. Before that I have been building some small things on my parents terrace. A summer 2020 we built a mini ramp at the very same spot. I have also been involved with building mini ramp at Wake Valley.",
  "parent_mini": "Miniramp at my parents' terrace",
  "bommari": "Bommari private indoor park",
  "wake_valley": "Wake Valley",
  "welcome": "Well, look at you! You found my page!",
  "welcome_long": "Welcome aboard, I am Jerry Selin. I tend to stack projects, duties and responsibilities on my plate. Why do I do that? Doing and learning something new fascinates me, that's why. A lot of projects has been completed but some projects are lifetime deals. I have added some references from both types on this page. Enjoy, get inspired & start doing your thing!",
  "ar": "Instagram AR-filters",
  "giphy": "Instagram animated stickers",
  "3d_modelling": "3D modelling",
  "3d_printing": "3D printing",
  "photo_editing": "Photo making and editing",
  "video_editing": "Video editing",
  "electronics": "Electronics",
  "events": "Organizing events",
  "3d_modelling_desc": "I have done several skate park models with SketchUp. For 3d printing models and general engineering I use OnShape, SolidWorks and NX CAD.",
  "events_desc": "Most of the events are organized with TTHP (ski club in our university). Besides this, I often find myself organizing the small events like indoor skate park rent for a night. Following posters are also created by me.",
  "student": "University student",
  "student_desc": "I have bachelor of science degree and I am studying for masters degree in information technology at Tampere University.",
  "electronics_desc": "el",
  "giphy_desc": "Gifs I have added to Giphy. These are available on apps that uses Giphy, for example, Instagram, Snapchat and Telegram.",
  "how_old": "How old are you?",
  "electronics_desc_1": "Besides burning my hands with soldering iron, I have also burned some code into Arduino. Here are couple of my electronics projects:" ,
  "electronics_desc_2": "I have soldered a ",
  "electronics_desc_3": "bluetooth speaker",
  "electronics_desc_4": ". Case of the speaker is originally made out of cardboard and duct tape. After a while, I decided to use carbon fiber car tape to make it look more elegant.",
  "electronics_desc_5": "Arduino smart sauna",
  "electronics_desc_6": ", which is build with WiFi Arduino, servo motor and a piece of code. It is a web server that can turn my sauna on and off.",
  "ar_desc": "One filter which generates random skate spot and one which generates random skate trick. Made with Spark AR Studio.",
  "bday1": "Thank you for asking. I am ",
  "bday2": " years old and my birthday is just around the corner, only ",
  "bday3": " days remaining. Remember to get me a nice present.",
  "how_you_learned": "How did you learn all this?",
  "how_you_learned_answer": "Internet dude, from internet! It takes just couple Google searches and Youtube videos to learn something new.",
  "scroll_top": "Scroll to top",
  "open_skatevideos": "Open skate videos page",
  "open_developer": "Open developer page",
  "open_entrepreneur": "Open entrepreneur page",
  "open_jackofalltrades": "Open other projects page",
  "dev_title": "I started writing code in 2017",
  "dev_intro_1": "I started studying automation technology at Tampere University of Technology in 2016. I had some programming courses which were taught with C++. I was interested in programming but wasn't sure if I would rather study something else.",
  "dev_intro_2": "2019 I started to create my first personal project, Android app called Spottimettä. After creating that, personal projects have been filling a lot of my timetable. I also decided that I want to focus on programming and I changed my subject of studying to Information technology.",
  "dev_intro_end": "Here's some of my personal projects",
  "mobile": "Mobile apps",
  "web": "Web apps",
  "server": "Backend",
  "what_you_do": "What is your status?",
  "what_you_do_answer": "I am student in informational technology at Tampere University. I am also working part-time as software developer. In addition to these, I work as a entrepreneur.",
  "android_desc": "I started my personal projects with Spottimettä skatemap. The app is native Android app that let's users add their favourite skate places in a map. The data in app is synchronized real-time with users. The app turned out to be success, or at least it has over 1000 downloads and over 4.8 starts average rating. App is available available at ",
  "play_store": "Play Store",
  "flutter_desc_1": "A lot of people contacted me asking if I could make Iphone version of Spottimettä. I wasn't too excited to learn Native Iphone apps, because I didn't have Iphone or Mac and I had read only downsides of Apple dev thingies. Also React Native performance with Google Maps was too weak for this project. Then I met Flutter and made ",
  "spottimetta_ios": "Spottimettä iOS",
  "flutter_desc_2": " app with that. I really liked the Flutter framework and the Dart language so I made my next mobile app Distant S.K.A.T.E. with Flutter too. Distant skate allows users to send skate trick videos as a challenge to other players. It is a remix from Game of S.K.A.T.E., which is a skaters version of basketball H.O.R.S.E. Links for Distant S.K.A.T.E: ",
  "ios": "iOS",
  "android": "Android",
  "web_page": "Web page",
  "html_css_js_desc_1": "My first web project was Spottimettä web pages and the ",
  "spottimetta_web": "Spottimettä web application",
  "html_css_js_desc_2": ". The web app has all the same features than Android app, including image watermarking and spot sharing by url. Six months later I implemented ",
  "distant_web_page": "Distant S.K.A.T.E.'s web sites",
  "html_css_js_desc_3": ". I wanted to try something new so I used web components on this one.",
  "react_desc_1": "I wanted to learn some of the popular frameworks. I decided to learn React. I made ",
  "data_spottimetta": "Data Spottimettä",
  "react_desc_2": " with React. Data Spottimettä is a web site that calculates and shows data from the Spottimettä apps. It even has skate spot statistics compared to city population.",
  "vue_desc_1": "I had an awesome opportunity to create new web sites. This time I wanted to try Vue.js for the task. The implemented web page is ",
  "napalm_site": "Napalm Custom web page",
  "vue_desc_2": ". Besides the publicly visible UI, the page has some customization options for admin user. I really enjoyed Vue.js and I'm eagerly waiting for the next opportunity to get my hands on that framework.",
  "flutter_web_desc_1": "You might have notice that this page does not feel like usual web page. That's because ",
  "flutter_web_desc_2": "this page",
  "flutter_web_desc_3": " is made with Flutter, the very same framework that I have used to create mobile apps. Flutter web is still kind of... not ready. I have made some hacking to get these pages feel more like web pages and not mobile app. See the source code from my Github (link in Footer).",
  "firebase_desc": "Firebase is Google's serverless. I found the service when I started to make Spottimettä Android app. I used realtime database for Spottimettä. I enjoyed Firebase, so I used it as a backend for Distant S.K.A.T.E. too. This time I used Cloud Firestore as a database. Besides databases, I have used following services provided by Firebase: Cloud Messaging (push notifications), Gallery (user uploaded videos and images ), Authentication (Google, Apple ja Facebook sign ins), Hosting (for all my sites) and Functions to run Node.JS code on server.",
  "node_desc": "Node.JS is familiar to me from my studies and work. In my personal projects, I have used Node.JS with Firebase functions. With functions, I have implemented, for example, email and push notifications, database periodic cleaning, collecting amount of signed in users in that day and providing API that data.spottimetta.fi uses.",
  "wordpress_desc": "There are couple of Wordpress online store projects where I am involved. Those are not yet public information so I better not tell anything more.",
  "python_desc": "Python have been helping me a lot when I have needed some parsing for my files. When it comes to online world, I have used Selenium to scrape data from multiple web site to my local computer. Besides these, I have made couple Telegram bots with Python. One bot can tell your closest skate spot based on your location and another can is virtual version of Skate or Dice game. Skate or Dice game has dice, where numbers have been replaced with part of a skate trick. Bots are not deployed as I don't have server to run Python.",
  "arduino_desc": "I tried to make some super cool IoT solutions with Arduino. Mostly the components came broken from China so I kind of gave up on it. But I have succesfully made an periodic pet feeder and server that controls my sauna. More from those electronic projects can be found at ",
  "other_page": "other projects page",
  "dot": "."


}