{
  "entrepreneur": "Entrepreneur",
  "skater": "Skater",
  "developer": "Developer",
  "skatevideos": "Skatevideos",
  "frontpage": "Front Page",
  "navigation": "Navigation",
  "jackofalltrades": "Jack of all trades",
  "movies_by_date": "Movies by release date",
  "ig_highlights": "Highlighted Instagram videos",
  "other": "Other",
  "jerryselin": "Jerry Selin",
  "Jerry Selin": "Jerry Selin",
  "skatepark_building": "Building skateparks",
  "skatepark_building_desc": "Building skateable things have always been part of my skateboarding. I enjoy building as weird obstacles as my bag of tricks. I have been building and planning the Bommari indoor skatepark since 2016. Before that I have been building some small things on my parents terrace. A summer 2020 we built a mini ramp at the very same spot. I have also been involved with building mini ramp at Wake Valley.",
  "parent_mini": "Miniramp at my parents' terrace",
  "bommari": "Bommari private indoor park",
  "wake_valley": "Wake Valley",
  "welcome": "Well, look at you! You found my page!",
  "welcome_long": "Welcome aboard, I am Jerry Selin. I tend to stack projects, duties and responsibilities on my plate. Why do I do that? Doing and learning something new fascinates me, that's why. A lot of project have been completed but some projects are lifetime deals. I have added some references from both types on this page. Enjoy, get inspired & start doing your thing!",
  "ar": "Instagram AR-filtters",
  "giphy": "Instagram animated stickers",
  "3d_modelling": "3D modelling",
  "3d_printing": "3D printing",
  "photo_editing": "Photo making and editing",
  "video_editing": "Video editing",
  "electronics": "Electronics",
  "events": "Organizing events",
  "3d_modelling_desc": "I have done several skate park models with SketchUp. For 3d printing models and general engineering I use OnShape, SolidWorks and NX CAD.",
  "events_desc": "Most of the events are organized with TTHP (ski club in our university). Besides this, I often find myself organizing the small events like indoor skate park rent for a night. Following posters are also created by me.",
  "student": "University student",
  "student_desc": "I have bachelor of science degree and I am studying for masters degree in information technology at Tampere University."
}