{
  "entrepreneur": "Yrittäjä",
  "skater": "Skeittari",
  "developer": "Sovelluskehittäjä",
  "skatevideos": "Skeittivideot",
  "frontpage": "Etusivu",
  "navigation": "Navigointi",
  "jackofalltrades": "Jokapaikanhöylä",
  "movies_by_date": "Kesäleffat julkaisujärjestyksessä",
  "ig_highlights": "Poimintoja Instagram videoista",
  "other": "Muu",
  "jerryselin": "Jerry Selin",
  "Jerry Selin": "Jerry Selin",
  "skatepark_building": "Skeittipaikkojen rakentaminen",
  "skatepark_building_desc": "Skeittikamojen rakentelu on ollut lähellä sydäntä yhtä kauan kuin itse skeittaus.\n Omatekemiä obstaakkeleita on mukavampi skeitata ja silloin on mahdollista saada yhtä kiero palikka kuin tekijän mielikuvitus. Aluksi rakennetut obstaakkelit sijoittuivat vanhempien terassille. 2016 vuodesta asti skeittiobstaakkeleita ollaan rakennettu Tampereen (teknillisen) yliopiston tiloissa sijaitsevaan Bommariin. Paluu alkulähteelle tapahtui kun rakensimme minirampin vanhempien terassille 2020. Tässä välissä tuli oltua mukana ja haettua oppia Ylöjärven Wake Valleyn minirampin rakentamisen kautta.",
  "parent_mini": "Vanhempien terassilla sijaitseva miniramppi",
  "bommari": "Bommari",
  "wake_valley": "Ylöjärven Wake Valley",
  "welcome": "Hiiohoi ja halojatapäivää!",
  "welcome_long": "Tervetuloa linjoille, mun nimi on Jerry Selin. Mulla on tapana kasata itelleni erilaisia projekteja vähän turhankin paljon. Tämä luultavasti siksi, koska kaikenlainen tekeminen ja uuden oppiminen kiinnostaa. Jotkut projektit ovat saatu selätettyä onnistuneesti, kun taas jotkut ovat jääneet piristämään elämää ja pitämään kiireisenä. Molempien kategorioiden töitä alkaa olla jo mukava pinkka, joten päätin keräillä niistä parhaimmistoa tänne. Tutustu, inspiroidu & toteuta!",
  "ar": "Instagramin AR-filtterit",
  "giphy": "Animoidut tarrat mm. Instagramiin",
  "3d_modelling": "3D mallinnus",
  "3d_printing": "3D tulostus",
  "photo_editing": "Valokuvien muokkaaminen ja piirtäminen tietokoneella",
  "video_editing": "Videoiden muokkaaminen",
  "electronics": "Elektroniikka",
  "events": "Tapahtumien järjestäminen",
  "3d_modelling_desc": "Skeittiparkkien piirtämiseen omasta mielestäni varsin ässä työkalu on SketchUp. Sillä olenkin jokusen parkin piirrellyt. Vastapainoksi suurinpiirtein mitoille ja viivojen lisäilyn avulla piirtelyyn, insinööreilyyn ja 3d printattujen kappaleiden mallinnukseen olen käyttänyt OnShape, SolidWorks, Fusion 360 ja NX CAD ohjelmia.",
  "events_desc": "Tapahtumien järjestäminen on tapahtunut pääsääntöisesti TTHP:n (Tampereen Teekkarien Hiihto- ja Purjehdusseura) kautta. Tämän lisäksi usein organisoin pienempiä tapahtumia kuten skeittihallin vuokrausta kavereiden kanssa. Myös seuraavat tapahtumajulisteet ovat omaa tuotantoani.",
  "student": "Opiskelija",
  "student_desc": "Opiskelen Tietotekniikan ylempää korkeakoulututkintoa Tampereen Yliopistossa (ent. TTY).",
  "electronics_desc_1": "Elektroniikan saralla olen hieman päässyt kokeilemaan kolvia kädessä sekä tunkemaan koodia Arduinon sisään. Omia elektroniikkaprojekteja on mm. nämä:" ,
  "electronics_desc_2": "pahvista ja ilmastointiteipistä valmistettu ",
  "electronics_desc_3": "bluetooth matkakajari",
  "electronics_desc_4": ", joka on myöhemmin päällystetty auton yliteippaukseen suunnitellulla hiilikuituteipillä.",
  "electronics_desc_5": "Saunamaatti",
  "electronics_desc_6": ", eli WiFi Arduino, servomoottori ja koodinpätkä yhdistettynä. Tästä syntynyt lopputulos on web palvelin, joka pystyy laittamaan saunan päälle tai pois päältä." ,
  "giphy_desc": "Giphy palveluun lisättyjä gif kuvia. Nämä ovat saatavilla Instagram, Snapchat, Telegram appeissa sekä monissa muissa sovelluksissa, jotka käyttävät Giphya.",
  "how_old": "Kuinka vanha olet?",
  "ar_desc": "Satunnaisen skeittispotin ja skeittitempun generoivat taulut, jotka sijoittuvat käyttäjän pään yläpuolelle. Näiden tekemiseen käytetty Spark AR Studio ohjelmaa.",
  "bday1": "Kiitos kysymästä, olen ",
  "bday2": " vuotias. Itse asiassa mun synttärit on aivan nurkan takana ja niihin on enää ",
  "bday3": " päivää jäljellä. Kai oot muistanu hommata mulle kivan lahjan?",
  "how_you_learned": "Miten oot oppinu tekeen kaiken tän?",
  "how_you_learned_answer": "Käytän interneettiä, sieltä löytää apua kaikkeen. Loppu on vaan innostuksesta kiinni.",
  "scroll_top": "Rullaa alkuun",
  "open_skatevideos": "Siirry skeittivideot sivulle",
  "open_developer": "Siirry sovelluskehittäjä sivulle",
  "open_entrepreneur": "Siirry yrittäjyys sivulle",
  "open_jackofalltrades": "Siirry muiden projektien sivulle",
  "dev_title": "Koodaus alkoi vuonna 2017",
  "dev_intro_1": "Aloitin automaatiotekniikan opinnot Tampereen Teknillisessä Yliopistossa 2016. Opintoihini sisältyi ohjelmointia pääasiassa C++ käyttäen. Ohjelmointi vaikutti alusta asti kiinnostavalta, kuten monet muutkin opintokokonaisuudet.",
  "dev_intro_2": "2019 kesällä tein ensimmäisen henkilökohtaisen ohjelmointiprojektin harrastemielessä. Projekti oli Spottimettä Android sovellus. Tuon projektin jälkeen harrasteprojekteja on alkanut kasaantumaan ja ne vievätkin valtaosan vapaa-ajastani. Tästä innostuneena olenkin vaihtanut opiskelemaan tietotekniikkaa.",
  "dev_intro_end": "Hieman henkilökohtaisia projektejani sekä niissä käytettyjä tekniikoita",
  "mobile": "Mobiilisovellukset",
  "web": "Web-sovellukset",
  "server": "Backend",
  "what_you_do": "Mitä teet?",
  "what_you_do_answer": "Olen tietotekniikan opiskelija Tampereen Yliopistossa. Lisäksi työskentelen osa-aikaisena ohjelmistokehittäjänä. Näiden lisäksi toimin myös yrittäjänä.",
  "android_desc": "Ensimmäisenä harrasteprojektina tein Spottimettä Android sovelluksen. Sovelluksessa käyttäjät voivat jakaa lempi skeittauspaikkojaan sekä kommentoida muiden paikkoja. Kartan käyttämä data synkronoituu reaaliaikaisesti käyttäjille. Sovelluksen vastaanotto on ollut ilmiömäisen hyvää. Tästä kertoo yli tuhat latausta sekä yli 4,8 tähden keskiarvo arvosteluissa. Tsekkaa sovellus ",
  "play_store": "Play Storesta",
  "flutter_desc_1": "Monet kyselivät, mikäli olisi mahdollista tehdä myös Iphonella toimiva versio Spottimetästä. Natiivin iOS sovelluksen teko ei juurikaan kiinnostanut, eikä ollut edes mahdollista ilman Iphonea ja Macbookkia. React Native taas kärsi liian suurista suorituskykyongelmista karttasovelluksissa. Vastaan tuli kuitenkin Flutter. Tämän avulla tein ",
  "spottimetta_ios": "Spottimettä iOS",
  "flutter_desc_2": " sovelluksen. Jäin koukkuun Flutteriin ja tein seuraavankin harrastesovelluksen kyseisellä tekniikalla. Sovellus mahdollistaa jokaiselle skeittarille tutun Game of S.K.A.T.E. pelimuodon pelaamisen etänä. Game of S.K.A.T.E.ssa pitää vuorotellen tehdä temppu ja vastustajan pitää tehdä sama tai ottaa kirjain. 5 kirjainta = häviö. Sovelluksessa tämä suoritetaan lähettämällä videoita. Tietoa ja latauslinkit sovellukseen: ",
  "ios": "iOS",
  "android": "Android",
  "html_css_js_desc_1": "Ensimmäiseksi webbiprojektiksi tein Spottimetän kotisivut sekä sivuilta löytyvän ",
  "spottimetta_web": "Spottimettä web-sovelluksen",
  "html_css_js_desc_2": ". Sovellus sisältää kaikki samat toiminnallisuudet kuin Android sovellus. Tähän kuuluu mm. valokuvien vesileimaaminen sekä paikkojen jakaminen url-osoitteen avulla. Puoli vuotta myöhemmin toteutin ",
  "distant_web_page": "Distant S.K.A.T.E.n webbisivut",
  "html_css_js_desc_3": ". Tähän toteutukseen halusin käyttää jotain minulle uutta tekniikkaa, joten toteutuksessa on käytetty web komponentteja.",
  "react_desc_1": "Halusin oppia jonkun tunnetuista web viitekehyksistä. Päätin opetella Reactin käytön, koska se vaikutti lupaavimmalta. Ensimmäiseksi ohjelmaksi tein ",
  "data_spottimetta": "Data Spottimetän",
  "react_desc_2": ". Data spottimettä on sivusto, jossa on esillä Spottimetän dataan perustuvia tilastoja sekä kuvaajia. Sivuilla löytyy jopa kuvaaja, josta selviää kaupungin spottien määrän suhde kaupunkien asukaslukuun.",
  "vue_desc_1": "Sain taas käsiini mahdollisuuden toteuttaa nettisivut. Tällä kertaa halusin kokeilla Vue.js viitekehystä sivujen rakentamiseen. Sivusto, jonka toteutin on ",
  "napalm_site": "Napalm Customin kotisivu",
  "vue_desc_2": ". Sivustolta löytyy näkyvän osan lisäksi hieman muokkausmahdollisuuksia admin käyttäjälle. Myöhemmin toteutin ",
  "vue_desc_3": "skeittivideot.fi",
  "vue_desc_4": " arkiston Vuella. Arkisto pyrkii kokoamaan kaikki suomalaiset rullalautailuvideot, sekä tarjoamaan hyvät hakuominaisuudet. Käyttäjät voivat lisätä arkistoon videoita anonyymisti.",
  "flutter_web_desc_1": "Fiksuimmat ovat varmaankin jo keksineet projektin, johon olen käyttänyt tätä tekniikkaa. Tuijottelet tuotosta parhaillasi. ",
  "flutter_web_desc_2": "Tämä sivu",
  "flutter_web_desc_3": " on tehty Flutterilla. Eli samalla tekniikalla kuin mun mobiilisovellukset. Flutter web on vielä melko keskeneräinen teknologia, joten näille sivuille on joutunut tekemään jokusen kikan, jotta ne sai toimimaan webbimäisesti. Tsekkaa lähdekoodi Githubista sivun alapalkista.",
  "firebase_desc": "Firebase on Googlen serverless backend palvelu. Tutustuin kyseiseen palveluun ja sen reaaliaikaiseen tietokantaan, kun aloin tehdä Spottimettää. Palvelu osoittautui vallan mainioksi, joten tein Distant S.K.A.T.E.n backendin myös sinne, tosin käyttäen eri tietokantaa (Cloud Firestore). Tämän lisäksi olen käyttänyt Firebasen palveluista seuraavia: Cloud Messaging sovellusilmoituksia varten, Gallery sovelluksen videoiden ja kuvien jakamista varten, Authentication Google, Apple ja Facebook kirjautumisia varten, Hosting omien verkkosivujen hostaamiseen sekä Functions suorittamaan Node.JS funktioita palvelimella.",
  "node_desc": "Node.JS on minulle tuttu tekniikka opinnoista sekä työelämästä. Omissa projekteissa olen käyttänyt tekniikkaa Firebasen funktioiden kautta. Toteutettuja funktioita on mm. sähköposti ja push -ilmoitusten lähetys, tietokantojen siivous tietyin väliajoin, päivän päätteeksi kirjautuneiden kerääminen raporttiin sekä data.spottimetta.fi sivuston käyttämän rajapinnan tarjoaminen.",
  "wordpress_desc": "Oon mukana työstämässä muutamaa Wordpress nettikauppaprojektia, joissa on ollut käytössä valmiit teemat. Valmistunut mainitsemisen arvoinen projekti on suomalaisia käsintehtyjä vaate- ja lifestyletuotteita myyvä ",
  "wordpress_desc_2": "Katve Lifestyle",
  "python_desc": "Pythonia on tullut käytettyä koulun lisäksi melko laajalti kaikkeen tiedostojenkäsittelyyn. Selenium on myös tullut tutuksi, kun on tarvinnut automatisoidusti tallentaa useiden nettisivujen sisällöt parsittuna omalle koneelle. Tämän lisäksi olen myös tehnyt Pythonilla muutaman Telegram botin. Toinen botti osasi kertoa sijainnin perusteella lähimmän skeittispotin ja toinen simuloi noppien heittoa. Noppien heittoa simuloivan botin noppien silmälukujen tilalla oli skeittitempun osan nimi ja noppien kokonaisuudesta muodostui skeittitemppu. Botit eivät ole tällä hetkellä toiminnassa, koska ei ole palvelinta niitä varten.",
  "arduino_desc": "Yritin tehdä innovatiivisia IoT ratkaisuja Arduinon avulla. Lopputulos oli kuitenkin liian usein se, että kiinasta saapui usean kuukauden odottelun jälkeen viallinen osa. Täysin pettymykseen tämä osa-alue ei kuitenkaan päättynyt. Onnistuin tekemään tietyin väliajoin ruokaa antavan ruokinta-automaatin eläimille, sekä web palvelimen, jonka avulla voi laittaa saunan päälle etänä. Lisätietoa näistä elektroniikkaprojekteista löytyy ",
  "other_page": "muut projektit sivulta",
  "dot": ".",
  "tmi_desc": "Kiinnostuitko jostain sivun projektista? Nousiko tarve omalle mobiilisovellukselle tai nettisivuille? Teen omalla toiminimelläni digitaalisia palveluita asiakkaan tarpeisiin. Ota siis yhteyttä sivun alapalkin sähköpostikuvakkeesta ja katsotaan miten voin olla avuksi.",
  "copy_email": "Kopio sähköpostiosoite leikepöydälle (jerry@jerrysel.in)",
  "phaser_desc": "Lapsuusvuosina tuli pelattua paljon selaimella toimivia pelejä. Nyt hieman vanhempana halusin lisätä oman panokseni kyseiseen maailmaan. Tein ",
  "phaser_desc_2": "Life of Jerry",
  "phaser_desc_3": " pelin, jossa tarkoituksena on kehittyä skeittarina ja syrjäyttää skeittimaailman johtaja. Koodauksen lisäksi toteutin peliin grafiikat, äänitehosteet ja musiikit.",
  "phaser_desc_4": " Katso lyhyt esittelyvideo pelistä ",
  "phaser_desc_5": "täältä",
  "wantMusic": "Oon tehny melko tarttuvaa 8 bittistä musiikkia. Laitetaanko soimaan samalla kun selailet sivua?",
  "gcp_desc": "Pyrin kasvattamaan nykyisiä projekteja uusilla innovatiivisilla ominaisuuksilla. Halu on kova päästä laajentamaan projekteja Firebasesta Google Cloud Platformiin. Spottimetän datan perusteella ",
  "gcp_desc_2": "automaattisesti päivittyvä MyMaps",
  "gcp_desc_3": " kartta antaa käyttäjälle mahdollisuuden avata Spottimetän paikat puhelimen omassa Google Maps sovelluksessa. Cloud Scheduler kutsuu päivittäin Cloud Run ympäristössä pyörivää Docker-konttia, jossa Pythonin avulla haetaan Spottimetän data. Data muutetaan .kml muotoon ja se päivitetään MyMaps karttaan Seleniumin avulla."

}